app/services/messages_service.rb

INSERT INTO "messages" ("author", "message", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["author", "dito"], ["message", "hello fellas"], ["created_at", "2020-12-19 14:10:29.309874"]]
---
  def create
    @message = Message.create(@params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_message
    @message = Message.find_by(id: @params[:message_id])