app/controllers/messages_controller.rb

  def create
    service = MessagesService.new(message_params)
    service.create
---
INSERT INTO "messages" ("author", "message", "created_at", "lock_version") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "Ruby"], ["message", "Hello World"], ["created_at", "2020-12-19 16:28:57.694822"], ["lock_version", 0]]